package quiz;

public class C08_FiveDice {

	
	/*
	  랜덤으로 5개의 주사위를 굴린 다음에 결과를 통해 다음을 구분하는 클래스를 만들어보세요
	  
	  1. 풀하우스(같은 눈이 2개 + 3개)(11666/22333/63663)(주사위 눈이 점수)
	  2. 스몰 스트레이트(1234/2345/3456)
	  3. 라지 스트레이트(12345/23456)
	  4. 4다이스 (같은숫자 4개) (주사위 눈이 점수)
	  5. 5다이스 (같은숫자 5개) (50점)
	  
	  ※게임까지 구현하고 싶으신 분은 Yacht을 검색해보세요
	  # 방법
	  	(1) 3번을 던지는데 첫번째는 5개 다던짐
	  	(2) 두번째는 킵할건하고 나머지 던지고싶은거 던짐
	  	(3) 마지막도 두번쨰와 같다
	  # 메서드
	  	(1) 모든 주사위를 던지는 메서드
	  	(2) 원하는 주사위를 제외하고 나머지를 던지는 메서드
	  	(3) 주사위를 새로 던질때 마다 위의 1,2,3,4,5 중 해당하는 것이 있는지 체크하는 메서드
	 */
}
